zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eray/Eray/IfxEray_Eray.h
/** \brief GTU06 configuration.
 */
typedef struct
{
    uint16 acceptedStartupDeviation;     /**< \brief expanded range of measured deviation for startup Frames during integration. */
    uint16 maxDriftOffset;               /**< \brief maximum drift offset between two nodes. */
} IfxEray_Eray_Gtu06Config;

/** \brief GTU07 configuration.
 */
typedef struct
{
    uint16 staticSlotLength;     /**< \brief duration of static slot in macroticks. */
    uint16 staticSlotsCount;     /**< \brief number of static slots in a communication cycle. */
} IfxEray_Eray_Gtu07Config;

/** \brief GTU08 configuration.
 */
typedef struct
{
    uint8  dynamicSlotLength;     /**< \brief duration of dynamic slot in macroticks. */
    uint16 dynamicSlotCount;      /**< \brief number of dynamic slots in a communication cycle. */
} IfxEray_Eray_Gtu08Config;

/** \brief GTU09 configuration.
 */
typedef struct
{
    uint8                    staticActionPoint;      /**< \brief static slots and symbol window action point. */
    uint8                    dynamicActionPoint;     /**< \brief dynamic slots action point. */
    IfxEray_IdleDynamicSlots idleDynamicSlots;       /**< \brief duration of dynamic slot idle phase. */
} IfxEray_Eray_Gtu09Config;

/** \brief GTU10 configuration.
 */
typedef struct
{
    uint16 maxOffsetCorrection;     /**< \brief maximum offset correction to be applied by the internal clock synchronization algorithm. */
    uint16 maxRateCorrection;       /**< \brief maximum rate correction to be applied by the internal clock synchronization algorithm. */
} IfxEray_Eray_Gtu10Config;

/** \brief GTU11 configuration.
 */
typedef struct
{
    IfxEray_ExternalOffsetCorrection externalOffsetCorrection;     /**< \brief External clock offset correction value. */
    IfxEray_ExternalRateCorrection   externalRateCorrection;       /**< \brief External clock rate correction value. */
    IfxEray_ExternalOffset           externalOffset;               /**< \brief External offset correction control. */
    IfxEray_ExternalRate             externalRate;                 /**< \brief External rate correction control. */
} IfxEray_Eray_Gtu11Config;

/** \} */

/** \addtogroup IfxLld_Eray_Eray_Structures
 * \{ */
/** \brief Gloabl Timing Unit configuration structure.
 */
typedef struct
{
    IfxEray_Eray_Gtu01Config gtu01Config;     /**< \brief GTU01 configuration. */
    IfxEray_Eray_Gtu02Config gtu02Config;     /**< \brief GTU02 configuration. */
    IfxEray_Eray_Gtu03Config gtu03Config;     /**< \brief GTU03 configuration. */
    IfxEray_Eray_Gtu04Config gtu04Config;     /**< \brief GTU04 configuration. */
    IfxEray_Eray_Gtu05Config gtu05Config;     /**< \brief GTU05 configuration. */
    IfxEray_Eray_Gtu06Config gtu06Config;     /**< \brief GTU06 configuration. */
    IfxEray_Eray_Gtu07Config gtu07Config;     /**< \brief GTU07 configuration. */
    IfxEray_Eray_Gtu08Config gtu08Config;     /**< \brief GTU08 configuration. */
    IfxEray_Eray_Gtu09Config gtu09Config;     /**< \brief GTU09 configuration. */
    IfxEray_Eray_Gtu10Config gtu10Config;     /**< \brief GTU10 configuration. */
    IfxEray_Eray_Gtu11Config gtu11Config;     /**< \brief GTU11 configuration. */
} IfxEray_Eray_GTUConfig;

/** \brief Pins configuration structure for Node A.
 */
typedef struct
{
    IfxPort_InputMode       rxInMode;        /**< \brief the RX pin input mode which should be configured */
    IfxPort_OutputMode      txOutMode;       /**< \brief the TX pin output mode which should be configured. */
    IfxPort_PadDriver       pinDriver;       /**< \brief the pad driver mode which should be configured. */
    IfxPort_OutputMode      txEnOutMode;     /**< \brief the TXEN pin output mode which should be configured. */
    const IfxEray_Rxd_In   *rxIn;            /**< \brief the RX Pin which should be configured. */
    const IfxEray_Txd_Out  *txOut;           /**< \brief the TX Pin which should be configured. */
    const IfxEray_Txen_Out *txEnOut;         /**< \brief the TXEN Pin which should be configured. */
} IfxEray_Eray_NodeA;

/** \brief Pins configuration structure for Node B.
 */
typedef struct
{
    IfxPort_InputMode       rxInMode;        /**< \brief the RX pin input mode which should be configured */
    IfxPort_OutputMode      txOutMode;       /**< \brief the TX pin output mode which should be configured. */
    IfxPort_PadDriver       pinDriver;       /**< \brief the pad driver mode which should be configured. */
    IfxPort_OutputMode      txEnOutMode;     /**< \brief the TXEN pin output mode which should be configured. */
    const IfxEray_Rxd_In   *rxIn;            /**< \brief the RX Pin which should be configured. */
    const IfxEray_Txd_Out  *txOut;           /**< \brief the TX Pin which should be configured. */
    const IfxEray_Txen_Out *txEnOut;         /**< \brief the TXEN Pin which should be configured. */
} IfxEray_Eray_NodeB;

/** \brief Protocol operation control properties.
 */
typedef struct
{
    uint8                  collisionAvoidanceDuration;     /**< \brief accepted duration of collision avoidance symbol. */
    IfxEray_StrobePosition strobePosition;                 /**< \brief sample count value for strobing. */
    IfxEray_Baudrate       baudrate;                       /**< \brief baud rate on the flexray bus. */
    uint8                  receiveWakeupTestDuration;      /**< \brief duration of received wakeup pattern in bit times. */
    uint8                  transmitWakeupRepetitions;      /**< \brief duration of transmitted wakeup pattern in bit times. */
    uint16                 transmissionStartTime;          /**< \brief duration of transmission start time. */
} IfxEray_Eray_Prtc1Control;

/** \brief Wakeup symbol control properties.
 */
typedef struct
{
    uint8 receiveWakeupIdleTime;      /**< \brief duration of received wakeup symbol idle phase. */
    uint8 receiveWakeupLowTime;       /**< \brief duration of received wakeup symbol low phase. */
    uint8 transmitWakeupIdleTime;     /**< \brief duration of transmit wakeup symbol idle phase. */
    uint8 transmitWakeupLowTime;      /**< \brief duration of transmit wakeup symbol low phase. */
} IfxEray_Eray_Prtc2Control;

/** \brief communication controller control properties.
 */
typedef struct
{
    boolean                      startupFrameTransmitted;         /**< \brief whether the key slot is used to transmit startup Frames. */
    boolean                      syncFrameTransmitted;            /**< \brief whether the key slot is used to transmit SYNC Frames. */
    uint8                        maxColdStartAttempts;            /**< \brief maximum number of attempts that a cold starting node is permitted. */
    uint8                        numberOfCyclePairsForActive;     /**< \brief number of even / odd cycle pairs that must have valid clock correction terms. */
    IfxEray_WakeupChannel        wakeupPatternChannel;            /**< \brief Wakeup pattern carry channel */
    IfxEray_TransmissionSlotMode transmissionSlotMode;            /**< \brief Initial transmission mode. */
    boolean                      clockSyncErrorHalt;              /**< \brief transition to HALT state due to a clock synchronization error. */
    boolean                      channelASymbolTransmitted;       /**< \brief selects channel A for MTS symbol transmission. */
    boolean                      channelBSymbolTransmitted;       /**< \brief selects channel B for MTS symbol transmission */
    boolean                      channelAConnectedNode;           /**< \brief whether the node is connected to channel A. */
    boolean                      channelBConnectedNode;           /**< \brief whether the node is connected to channel B. */
} IfxEray_Eray_Succ1Config;

/** \brief Communication listen timeout properties.
 */
typedef struct
{
    uint32                     listenTimeOut;          /**< \brief wakeup or startup listen timeout in microticks. */
    IfxEray_ListenTimeOutNoise listenTimeOutNoise;     /**< \brief upper limit for startup and wakeup listen timeout in the presence of noise. */
} IfxEray_Eray_Succ2Config;

/** \brief Clock correction fail properties.
 */
typedef struct
{
    uint8 clockCorrectionCyclesPassive;     /**< \brief maximum number of cycles missing clock correction lead active to passive state. */
    uint8 clockCorrectionCyclesHalt;        /**< \brief maximum number of cycles missing clock correctionlead to active or passive to halt. */
} IfxEray_Eray_Succ3Config;

