zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Eray/Eray/IfxEray_Eray.h
/** \} */

/** \addtogroup IfxLld_Eray_Eray_Structures
 * \{ */
/** \brief Communication Controller configuration structure.
 */
typedef struct
{
    uint32                    networkVectorLength;         /**< \brief length of network management vector. */
    uint8                     staticFramepayload;          /**< \brief payload length of static frame in double bytes. */
    uint8                     latestTransmissionStart;     /**< \brief number of dynamic slots before inhibit frame transmission in dynamic segment. */
    IfxEray_Eray_GTUConfig    gtuConfig;                   /**< \brief gloabl timing unit configuration structure. */
    IfxEray_Eray_Succ1Config  succ1Config;                 /**< \brief communication controller control properties. */
    IfxEray_Eray_Succ2Config  succ2Config;                 /**< \brief communication listen timeout properties. */
    IfxEray_Eray_Succ3Config  succ3Config;                 /**< \brief clock correction fail properties. */
    IfxEray_Eray_Prtc1Control prtc1Control;                /**< \brief protocol operation control properties. */
    IfxEray_Eray_Prtc2Control prtc2Control;                /**< \brief wakeup symbol control properties. */
} IfxEray_Eray_ControllerConfig;

/** \brief Interrupt control properties.
 */
typedef struct
{
    uint16     int0Priority;         /**< \brief the interrupt line 0 priority. Always 1 since all interrupts are handled at a time. */
    uint16     int1Priority;         /**< \brief the interrupt line 1 priority. Always 1 since all interrupts are handled at a time. */
    uint16     tint0Priority;        /**< \brief the timer interrupt 0 priority. Always 1 since all interrupts are handled at a time. */
    uint16     tint1Priority;        /**< \brief the timer interrupt 1 priority. Always 1 since all interrupts are handled at a time. */
    uint16     ndat0Priority;        /**< \brief the new data interrupt 0 priority. Always 1 since all interrupts are handled at a time. */
    uint16     ndat1Priority;        /**< \brief the new data interrupt 1 priority. Always 1 since all interrupts are handled at a time. */
    uint16     mbsc0Priority;        /**< \brief the message buffer status changed interrupt 0 priority. Always 1 since all interrupts are handled at a time. */
    uint16     mbsc1Priority;        /**< \brief the message buffer status changed interrupt 1 priority. Always 1 since all interrupts are handled at a time. */
    uint16     ibusyPriority;        /**< \brief the inputput buffer interrupt priority. Always 1 since all interrupts are handled at a time. */
    uint16     obusyPriority;        /**< \brief the output buffer interrupt priority. Always 1 since all interrupts are handled at a time. */
    IfxSrc_Tos int0IsrProvider;      /**< \brief the interrupt line 0 service provider. CPU or DMA. */
    IfxSrc_Tos int1IsrProvider;      /**< \brief the interrupt line 1 service provider. CPU or DMA. */
    IfxSrc_Tos tint0IsrProvider;     /**< \brief the timer interrupt line 0 service provider. CPU or DMA. */
    IfxSrc_Tos tint1IsrProvider;     /**< \brief the timer interrupt line 1 service provider. CPU or DMA. */
    IfxSrc_Tos ndat0IsrProvider;     /**< \brief the new data interrupt 0 service provider. CPU or DMA. */
    IfxSrc_Tos ndat1IsrProvider;     /**< \brief the new data interrupt 1 service provider. CPU or DMA. */
    IfxSrc_Tos mbsc0IsrProvider;     /**< \brief the message buffer status changed interrupt 0 service provider. CPU or DMA. */
    IfxSrc_Tos mbsc1IsrProvider;     /**< \brief the message buffer status changed interrupt 1 service provider. CPU or DMA. */
    IfxSrc_Tos ibusyIsrProvider;     /**< \brief the input buffer interrupt service provider. CPU or DMA. */
    IfxSrc_Tos obusyIsrProvider;     /**< \brief the output buffer interrupt service provider. CPU or DMA. */
} IfxEray_Eray_Interrupt;

/** \brief Message RAM configuration structure.
 */
typedef struct
{
    uint8                  firstDynamicBuffer;         /**< \brief first dynamic buffer index. */
    uint8                  numberOfMessageBuffers;     /**< \brief last configured buffer. */
    uint32                 fifoBufferStartIndex;       /**< \brief message buffers assigned FIFO. */
    uint8                  fifoDepth;                  /**< \brief fifo critical level. */
    uint16                 frameIdFilter;              /**< \brief Frame ID  used for rejection filtering. */
    IfxEray_ReceiveChannel receiveChannel;             /**< \brief FIFO receive channel. */
    uint16                 rejectedFrameId;            /**< \brief frame ID to be rejected by the FIFO. */
    uint8                  filteredCycleNumber;        /**< \brief the cycle set to which Frame ID and channel rejection filter are applied. */
    boolean                staticFifoDisabled;         /**< \brief fifo is not used in static segment. */
    boolean                fifoNullFramesRejected;     /**< \brief whether null frames stored in fifo or not. */
    boolean                bufferReconfigEnabled;      /**< \brief whether reconfiguration of message buffers is enabled or not. */
    boolean                fifoConfigured;             /**< \brief Whether receive FIFO configured or not. */
    IfxEray_Header        *header[128];                /**< \brief Header section of message buffer. */
    IfxEray_SlotConfig    *slotControl[128];           /**< \brief Transmit control properties. */
    uint32                *data[128];                  /**< \brief data section of message buffer. */
} IfxEray_Eray_MessageRAMConfig;

/** \} */

/** \addtogroup IfxLld_Eray_Eray_Node
 * \{ */
/** \brief Pins configuration structure.
 */
typedef struct
{
    const IfxEray_Eray_NodeA *nodeAPins;     /**< \brief Pins configuration structure for Node A. */
    const IfxEray_Eray_NodeB *nodeBPins;     /**< \brief Pins configuration structure for Node B. */
} IfxEray_Eray_Pins;

